Output from `terraform plan`
```
                          - Arguments = {
                              - "--dpr.config.key"       = "reference"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-reporting-hub-cdc-reference-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Stop Glue Streaming Job"                              = {
                      - Next       = "Update Hive Tables"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-reference-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Curated"            = {
                      - Next       = "Empty Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "reference"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      - Next       = "Truncate Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "reference"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Truncate Data"                                        = {
                      - Next       = "Start DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "reference"
                              - "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Update Hive Tables"                                   = {
                      - Next       = "Prepare Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "reference"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-hive-table-creation-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-reload-pipeline-nomis-reference-preproduction"
        name          = "dpr-reload-pipeline-nomis-reference-preproduction"
        tags          = {
            "Domain"         = "reference"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
            {
              - Comment = "Reload Pipeline Step Function"
              - StartAt = "Stop Glue Streaming Job"
              - States  = {
                  - "Archive Raw Data"                                     = {
                      - Next       = "Resume DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              - "--dpr.config.key"                        = "sentence"
                              - "--dpr.file.transfer.delete.copied.files" = "true"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              - "--dpr.file.transfer.retention.days"      = "0"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Copy Data to Temp-Reload Bucket"                      = {
                      - Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                        = "sentence"
                              - "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              - "--dpr.file.transfer.delete.copied.files" = "false"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              - "--dpr.file.transfer.retention.days"      = "0"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Temp Reload Bucket Data"                        = {
                      - End        = true
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "sentence"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Invoke DMS State Control Lambda"                      = {
                      - Next           = "Start Glue Batch Job"
                      - Parameters     = {
                          - FunctionName = "dpr-pipeline-notification-function"
                          - Payload      = {
                              - replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:COZGQVLSH626V2UY5INQ6UQ6OF52WF3RIXEQSYQ"
                              - "token.$"          = "$$.Task.Token"
                            }
                        }
                      - Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      - Retry          = [
                          - {
                              - BackoffRate     = 2
                              - ErrorEquals     = [
                                  - "Lambda.ServiceException",
                                  - "Lambda.AWSLambdaException",
                                  - "Lambda.SdkClientException",
                                  - "Lambda.TooManyRequestsException",
                                ]
                              - IntervalSeconds = 60
                              - MaxAttempts     = 2
                            },
                        ]
                      - TimeoutSeconds = 86400
                      - Type           = "Task"
                    }
                  - "Prepare Temp Reload Bucket Data"                      = {
                      - Next       = "Copy Data to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "sentence"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Resume DMS Replication Task"                          = {
                      - Next       = "Start Glue Streaming Job"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:COZGQVLSH626V2UY5INQ6UQ6OF52WF3RIXEQSYQ"
                          - StartReplicationTaskType = "resume-processing"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Start DMS Replication Task"                           = {
                      - Next       = "Invoke DMS State Control Lambda"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:COZGQVLSH626V2UY5INQ6UQ6OF52WF3RIXEQSYQ"
                          - StartReplicationTaskType = "reload-target"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Start Glue Batch Job"                                 = {
                      - Next       = "Archive Raw Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "sentence"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-reporting-hub-batch-sentence-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start Glue Streaming Job"                             = {
                      - Next       = "Switch Hive Tables for Prisons to Curated"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "sentence"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-reporting-hub-cdc-sentence-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Stop Glue Streaming Job"                              = {
                      - Next       = "Update Hive Tables"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-sentence-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Curated"            = {
                      - Next       = "Empty Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "sentence"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      - Next       = "Truncate Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "sentence"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Truncate Data"                                        = {
                      - Next       = "Start DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "sentence"
                              - "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Update Hive Tables"                                   = {
                      - Next       = "Prepare Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "sentence"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-hive-table-creation-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-reload-pipeline-nomis-sentence-preproduction"
        name          = "dpr-reload-pipeline-nomis-sentence-preproduction"
        tags          = {
            "Domain"         = "sentence"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
            {
              - Comment = "Reload Pipeline Step Function"
              - StartAt = "Stop Glue Streaming Job"
              - States  = {
                  - "Archive Raw Data"                                     = {
                      - Next       = "Resume DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              - "--dpr.config.key"                        = "visits"
                              - "--dpr.file.transfer.delete.copied.files" = "true"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              - "--dpr.file.transfer.retention.days"      = "0"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Copy Data to Temp-Reload Bucket"                      = {
                      - Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                        = "visits"
                              - "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              - "--dpr.file.transfer.delete.copied.files" = "false"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              - "--dpr.file.transfer.retention.days"      = "0"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Temp Reload Bucket Data"                        = {
                      - End        = true
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "visits"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Invoke DMS State Control Lambda"                      = {
                      - Next           = "Start Glue Batch Job"
                      - Parameters     = {
                          - FunctionName = "dpr-pipeline-notification-function"
                          - Payload      = {
                              - replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:J4LVURS4VLHPHRLINMR6OOUR7RDD6EKVHR7E63A"
                              - "token.$"          = "$$.Task.Token"
                            }
                        }
                      - Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      - Retry          = [
                          - {
                              - BackoffRate     = 2
                              - ErrorEquals     = [
                                  - "Lambda.ServiceException",
                                  - "Lambda.AWSLambdaException",
                                  - "Lambda.SdkClientException",
                                  - "Lambda.TooManyRequestsException",
                                ]
                              - IntervalSeconds = 60
                              - MaxAttempts     = 2
                            },
                        ]
                      - TimeoutSeconds = 86400
                      - Type           = "Task"
                    }
                  - "Prepare Temp Reload Bucket Data"                      = {
                      - Next       = "Copy Data to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "visits"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Resume DMS Replication Task"                          = {
                      - Next       = "Start Glue Streaming Job"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:J4LVURS4VLHPHRLINMR6OOUR7RDD6EKVHR7E63A"
                          - StartReplicationTaskType = "resume-processing"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Start DMS Replication Task"                           = {
                      - Next       = "Invoke DMS State Control Lambda"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:J4LVURS4VLHPHRLINMR6OOUR7RDD6EKVHR7E63A"
                          - StartReplicationTaskType = "reload-target"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Start Glue Batch Job"                                 = {
                      - Next       = "Archive Raw Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "visits"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-reporting-hub-batch-visits-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start Glue Streaming Job"                             = {
                      - Next       = "Switch Hive Tables for Prisons to Curated"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "visits"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-reporting-hub-cdc-visits-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Stop Glue Streaming Job"                              = {
                      - Next       = "Update Hive Tables"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-visits-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Curated"            = {
                      - Next       = "Empty Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "visits"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      - Next       = "Truncate Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "visits"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Truncate Data"                                        = {
                      - Next       = "Start DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "visits"
                              - "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Update Hive Tables"                                   = {
                      - Next       = "Prepare Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "visits"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-hive-table-creation-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-reload-pipeline-nomis-visits-preproduction"
        name          = "dpr-reload-pipeline-nomis-visits-preproduction"
        tags          = {
            "Domain"         = "visits"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be created
  + resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      + database_name               = (sensitive value)
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "dpr-dms-nomis-oracle-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "oracle"
      + extra_connection_attributes = "supportResetlog=TRUE"
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = 1521
      + server_name                 = (sensitive value)
      + ssl_mode                    = "none"
      + tags                        = {
          + "DMS_Source"     = "nomis"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                    = {
          + "DMS_Source"     = "nomis"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + username                    = (sensitive value)

      + postgres_settings {
          + map_boolean_as_boolean = true
        }
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be created
  + resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      + add_column_name                             = false
      + bucket_name                                 = "dpr-raw-zone-preproduction"
      + cdc_inserts_and_updates                     = true
      + cdc_inserts_only                            = false
      + cdc_max_batch_interval                      = 10
      + cdc_path                                    = "cdc"
      + certificate_arn                             = (known after apply)
      + compression_type                            = "NONE"
      + csv_delimiter                               = ","
      + csv_row_delimiter                           = "\\n"
      + data_format                                 = "parquet"
      + date_partition_enabled                      = false
      + enable_statistics                           = true
      + endpoint_arn                                = (known after apply)
      + endpoint_id                                 = "dpr-dms-nomis-s3-target-endpoint"
      + endpoint_type                               = "target"
      + engine_display_name                         = (known after apply)
      + external_id                                 = (known after apply)
      + glue_catalog_generation                     = false
      + id                                          = (known after apply)
      + include_op_for_full_load                    = true
      + kms_key_arn                                 = (known after apply)
      + max_file_size                               = 120000
      + parquet_timestamp_in_millisecond            = false
      + preserve_transactions                       = false
      + rfc_4180                                    = true
      + service_access_role_arn                     = (known after apply)
      + ssl_mode                                    = (known after apply)
      + status                                      = (known after apply)
      + tags                                        = {
          + "DMS_Source"     = "nomis"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                                    = {
          + "DMS_Source"     = "nomis"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + timestamp_column_name                       = "_timestamp"
      + use_csv_no_sup_value                        = false
      + use_task_start_time_for_full_load_timestamp = false
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be created
  + resource "aws_iam_policy" "dms-operator-s3-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-dms-nomis-operator-s3-target-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:*",
                          + "cloudwatch:*",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*Object*",
                          + "s3:PutObjectTagging",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3::*:dpr-*/*",
                          + "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:ListAccessPoints",
                          + "s3:ListJobs",
                          + "s3:ListObjects",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be created
  + resource "aws_iam_policy" "dms-s3-target-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-dms-nomis-s3-target-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be created
  + resource "aws_iam_role" "dms-operator-s3-target-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-nomis-operator-s3-target-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be created
  + resource "aws_iam_role" "dms-s3-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-nomis-s3-endpoint-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-nomis-operator-s3-target-role"
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-nomis-s3-endpoint-role"
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be destroyed
  # (because module.setup-dms-endpoints["prisoner"].module.dms_endpoints is not in configuration)
  - resource "aws_dms_endpoint" "dms-s3-target-source" {
      - database_name               = (sensitive value) -> null
      - endpoint_arn                = "arn:aws:dms:eu-west-2:972272129531:endpoint:47EOV2EP6Y53IZFTJDPNBFOM4ANYRHK3GSXBE7Q" -> null
      - endpoint_id                 = "dpr-dms-nomis-oracle-source-endpoint" -> null
      - endpoint_type               = "source" -> null
      - engine_name                 = "oracle" -> null
      - extra_connection_attributes = "supportResetlog=TRUE" -> null
      - id                          = "dpr-dms-nomis-oracle-source-endpoint" -> null
      - kms_key_arn                 = "arn:aws:kms:eu-west-2:972272129531:key/230cd1dc-21a5-459a-bd70-e1470e635848" -> null
      - password                    = (sensitive value) -> null
      - port                        = 1521 -> null
      - server_name                 = (sensitive value) -> null
      - ssl_mode                    = "none" -> null
      - tags                        = {
          - "DMS_Source"     = "nomis"
          - "Domain"         = "Common"
          - "Jira"           = "main"
          - "Resource_Type"  = "DMS Source Endpoint"
          - "Service_Bundle" = "true"
        } -> null
      - tags_all                    = {
          - "DMS_Source"     = "nomis"
          - "Domain"         = "Common"
          - "Jira"           = "main"
          - "Resource_Type"  = "DMS Source Endpoint"
          - "Service_Bundle" = "true"
        } -> null
      - username                    = (sensitive value) -> null

      - postgres_settings {
          - capture_ddls                 = false -> null
          - execute_timeout              = 0 -> null
          - fail_tasks_on_lob_truncation = false -> null
          - heartbeat_enable             = false -> null
          - heartbeat_frequency          = 0 -> null
          - map_boolean_as_boolean       = true -> null
          - map_jsonb_as_clob            = false -> null
          - max_file_size                = 0 -> null
        }
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be destroyed
  # (because module.setup-dms-endpoints["prisoner"].module.dms_endpoints is not in configuration)
  - resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      - add_column_name                             = false -> null
      - add_trailing_padding_character              = false -> null
      - bucket_name                                 = "dpr-raw-zone-preproduction" -> null
      - cdc_inserts_and_updates                     = true -> null
      - cdc_inserts_only                            = false -> null
      - cdc_max_batch_interval                      = 10 -> null
      - cdc_min_file_size                           = 0 -> null
      - cdc_path                                    = "cdc" -> null
      - compression_type                            = "NONE" -> null
      - csv_delimiter                               = "," -> null
      - csv_row_delimiter                           = "\\n" -> null
      - data_format                                 = "parquet" -> null
      - data_page_size                              = 0 -> null
      - date_partition_enabled                      = false -> null
      - dict_page_size_limit                        = 0 -> null
      - enable_statistics                           = true -> null
      - endpoint_arn                                = "arn:aws:dms:eu-west-2:972272129531:endpoint:4CHGVNILFZZZSB5MDHDA3WJLZPLN3SM42DCGDMI" -> null
      - endpoint_id                                 = "dpr-dms-nomis-s3-target-endpoint" -> null
      - endpoint_type                               = "target" -> null
      - engine_display_name                         = "Amazon S3" -> null
      - glue_catalog_generation                     = false -> null
      - id                                          = "dpr-dms-nomis-s3-target-endpoint" -> null
      - ignore_header_rows                          = 0 -> null
      - include_op_for_full_load                    = true -> null
      - max_file_size                               = 120000 -> null
      - parquet_timestamp_in_millisecond            = false -> null
      - preserve_transactions                       = false -> null
      - rfc_4180                                    = true -> null
      - row_group_length                            = 0 -> null
      - service_access_role_arn                     = "arn:aws:iam::972272129531:role/dpr-dms-nomis-s3-endpoint-role" -> null
      - ssl_mode                                    = "none" -> null
      - status                                      = "active" -> null
      - tags                                        = {
          - "DMS_Source"     = "nomis"
          - "Domain"         = "Common"
          - "Jira"           = "main"
          - "Resource_Type"  = "DMS Target Endpoint"
          - "Service_Bundle" = "true"
        } -> null
      - tags_all                                    = {
          - "DMS_Source"     = "nomis"
          - "Domain"         = "Common"
          - "Jira"           = "main"
          - "Resource_Type"  = "DMS Target Endpoint"
          - "Service_Bundle" = "true"
        } -> null
      - timestamp_column_name                       = "_timestamp" -> null
      - use_csv_no_sup_value                        = false -> null
      - use_task_start_time_for_full_load_timestamp = false -> null
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be destroyed
  # (because module.setup-dms-endpoints["prisoner"].module.dms_endpoints is not in configuration)
  - resource "aws_iam_policy" "dms-operator-s3-policy" {
      - arn       = "arn:aws:iam::972272129531:policy/dpr-dms-nomis-operator-s3-target-policy" -> null
      - id        = "arn:aws:iam::972272129531:policy/dpr-dms-nomis-operator-s3-target-policy" -> null
      - name      = "dpr-dms-nomis-operator-s3-target-policy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:*",
                          - "cloudwatch:*",
                          - "ec2:CreateNetworkInterface",
                          - "ec2:DescribeAvailabilityZones",
                          - "ec2:DescribeInternetGateways",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeVpcs",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "s3:*Object*",
                          - "s3:PutObjectTagging",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3::*:dpr-*/*",
                          - "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:ListAllMyBuckets",
                          - "s3:ListAccessPoints",
                          - "s3:ListJobs",
                          - "s3:ListObjects",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA6EX7PKX5T56UWEQI5" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be destroyed
  # (because module.setup-dms-endpoints["prisoner"].module.dms_endpoints is not in configuration)
  - resource "aws_iam_policy" "dms-s3-target-policy" {
      - arn       = "arn:aws:iam::972272129531:policy/dpr-dms-nomis-s3-target-policy" -> null
      - id        = "arn:aws:iam::972272129531:policy/dpr-dms-nomis-s3-target-policy" -> null
      - name      = "dpr-dms-nomis-s3-target-policy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                          - "kms:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA6EX7PKX5SMVGUNOKN" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be destroyed
  # (because module.setup-dms-endpoints["prisoner"].module.dms_endpoints is not in configuration)
  - resource "aws_iam_role" "dms-operator-s3-target-role" {
      - arn                   = "arn:aws:iam::972272129531:role/dpr-dms-nomis-operator-s3-target-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "dms.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-02-28T12:14:48Z" -> null
      - force_detach_policies = false -> null
      - id                    = "dpr-dms-nomis-operator-s3-target-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::972272129531:policy/dpr-dms-nomis-operator-s3-target-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "dpr-dms-nomis-operator-s3-target-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA6EX7PKX52GIJDRQJR" -> null
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be destroyed
  # (because module.setup-dms-endpoints["prisoner"].module.dms_endpoints is not in configuration)
  - resource "aws_iam_role" "dms-s3-role" {
      - arn                   = "arn:aws:iam::972272129531:role/dpr-dms-nomis-s3-endpoint-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "dms.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-02-28T12:14:48Z" -> null
      - force_detach_policies = false -> null
      - id                    = "dpr-dms-nomis-s3-endpoint-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::972272129531:policy/dpr-dms-nomis-s3-target-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "dpr-dms-nomis-s3-endpoint-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA6EX7PKX56EDPZDZNW" -> null
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be destroyed
  # (because module.setup-dms-endpoints["prisoner"].module.dms_endpoints is not in configuration)
  - resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      - id         = "dpr-dms-nomis-operator-s3-target-role-20240228121448779500000002" -> null
      - policy_arn = "arn:aws:iam::972272129531:policy/dpr-dms-nomis-operator-s3-target-policy" -> null
      - role       = "dpr-dms-nomis-operator-s3-target-role" -> null
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be destroyed
  # (because module.setup-dms-endpoints["prisoner"].module.dms_endpoints is not in configuration)
  - resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      - id         = "dpr-dms-nomis-s3-endpoint-role-20240228121448776700000001" -> null
      - policy_arn = "arn:aws:iam::972272129531:policy/dpr-dms-nomis-s3-target-policy" -> null
      - role       = "dpr-dms-nomis-s3-endpoint-role" -> null
    }

Plan: 22 to add, 61 to change, 22 to destroy.

```